* Adversarial Training Framework for PyTorch


Under construction.

** Results
*** CIFAR-10 L-inf \epsilon=8/255
#+begin_src
weight-decay = 5e-4
batch-size = 128
max-epochs = 110
lr = 1e-1, decaied at {100, 105} with 0.1
test with PGD20
#+end_src
**** PreAct ResNet-18
| Method                        | Best/Last | Clean |  FGSM | PGD-10 | PGD-20 |    AA |
|-------------------------------+-----------+-------+-------+--------+--------+-------|
| AT                            | B         | 84.07 | 62.42 |  53.33 |  52.43 | 48.52 |
|                               | L         | 84.35 | 62.23 |  52.49 |  51.83 | 48.34 |
| AWP-AT (200 epochs, Original) | B         | 80.51 | 62.19 |  55.72 |  55.20 | 49.96 |
| TRADES                        | B         | 82.21 | 61.66 |  54.04 |  53.48 | 49.24 |
|                               | L         | 82.00 | 61.53 |  53.73 |  53.02 | 49.27 |
| MART                          | B         | 78.61 | 61.32 |  55.00 |  54.49 | 47.05 |
|                               | L         | 78.61 | 61.32 |  55.00 |  54.49 | 47.05 |


**** WideResNet-28-10
| Method | Best/Last | Clean |  FGSM | PGD-10 | PGD-20 |    AA |
|--------+-----------+-------+-------+--------+--------+-------|
| AT     | B         | 86.59 | 64.77 |  55.35 |  54.04 | 51.02 |
|        | L         | 88.04 | 65.83 |  54.62 |  53.05 | 50.39 |
| TRADES | B         | 85.63 | 64.76 |  56.69 |  55.84 | 52.57 |
|        | L         | 85.60 | 64.88 |  56.65 |  55.81 | 52.60 |
| MART   | B         | 83.38 | 63.96 |  56.41 |  55.65 | 48.55 |
|        | L         | 83.49 | 64.19 |  56.23 |  55.26 | 48.97 |
*** PreAct ResNet-18, AT
| Dataset  | Norm  | PGD-20 | Natural |
|----------+-------+--------+---------|
| SVHN     | L_inf |  53.42 |   93.81 |
|          | L_2   |  67.86 |   92.73 |
| Cifar10  | L_inf |  52.43 |   84.07 |
|          | L_2   |  69.87 |   90.31 |
| Cifar100 | L_inf |  29.23 |   56.06 |
|          | L_2   |  41.88 |   63.88 |

*** L_inf
**** CIFAR-10
***** ResNet-18
|        | Natural |       |       |  FGSM |       |      | PGD-10 |       |      | PGD-20 |       |      |    AA |       |      |
| method |       B |     L |     D |     B |     L |    D |      B |     L |    D |      B |     L |    D |     B |     L |    D |
|--------+---------+-------+-------+-------+-------+------+--------+-------+------+--------+-------+------+-------+-------+------|
| AT     |   83.28 | 84.97 | -1.69 | 64.53 | 60.81 | 3.72 |  53.12 | 45.65 | 7.47 |  52.22 | 43.89 | 8.33 | 48.19 | 41.69 |  6.5 |
| TRADES |   83.50 | 82.70 |   0.8 | 65.18 | 63.90 | 1.28 |  53.78 | 52.07 | 1.71 |  52.70 | 50.78 | 1.92 | 49.15 | 47.88 | 1.27 |
| AWP    |   81.87 | 80.63 |  1.24 | 65.16 | 64.32 | 0.84 |  56.07 | 54.93 | 1.14 |  55.47 | 54.44 | 1.03 | 49.97 | 49.09 | 0.88 |
#+TBLFM: $4=$2-$3::$7=$5-$6::$10=$8-$9::$13=$11-$12::$16=$14-$15
***** WideResNet-28-10

**** CIFAR-100
***** ResNet-18
|        | Natural |       |       |  FGSM |       |      | PGD-10 |       |      | PGD-20 |       |      |    AA |       |      |
| method |       B |     L |     D |     B |     L |    D |      B |     L |    D |      B |     L |    D |     B |     L |    D |
|--------+---------+-------+-------+-------+-------+------+--------+-------+------+--------+-------+------+-------+-------+------|
| AT     |   54.82 | 56.34 | -1.52 | 36.65 | 31.71 | 4.94 |  29.19 | 21.95 | 7.24 |  28.77 | 21.31 | 7.46 | 24.36 | 19.72 | 4.64 |
| TRADES |   55.86 | 55.39 |  0.47 | 36.38 | 35.88 |  0.5 |  28.95 | 28.08 | 0.87 |  28.71 | 27.65 | 1.06 | 23.69 | 23.42 | 0.27 |
| AWP    |   54.03 | 54.00 |  0.03 | 37.98 | 37.79 | 0.19 |  31.68 | 31.46 | 0.22 |  31.37 | 31.14 | 0.23 | 25.80 | 25.69 | 0.11 |
#+TBLFM: $4=$2-$3::$7=$5-$6::$10=$8-$9::$13=$11-$12::$16=$14-$15
***** WideResNet-28-10
**** SVHN
***** ResNet-18
***** WideResNet-28-10

*** L_2
**** CIFAR-10
***** ResNet-18
|        | Natural |       |       |  FGSM |       |      | PGD-10 |       |      | PGD-20 |       |      |    AA |       |      |
| method |       B |     L |     D |     B |     L |    D |      B |     L |    D |      B |     L |    D |     B |     L |    D |
|--------+---------+-------+-------+-------+-------+------+--------+-------+------+--------+-------+------+-------+-------+------|
| AT     |   89.49 | 89.78 | -0.29 | 74.48 | 72.55 | 1.93 |  72.24 | 69.08 | 3.16 |  69.49 | 65.91 | 3.58 | 67.87 | 64.68 | 3.19 |
| TRADES |   87.06 | 87.55 | -0.49 | 74.25 | 71.81 | 2.44 |  72.47 | 69.65 | 2.82 |  70.73 | 67.07 | 3.66 | 69.15 | 66.03 | 3.12 |
| AWP    |   89.56 | 89.52 |  0.04 | 76.92 | 76.28 | 0.64 |  74.86 | 74.16 |  0.7 |  72.51 | 71.74 | 0.77 | 69.83 | 69.45 | 0.38 |
#+TBLFM: $4=$2-$3::$7=$5-$6::$10=$8-$9::$13=$11-$12::$16=$14-$15
***** WideResNet-28-10

**** CIFAR-100
***** ResNet-18
|        | Natural |       |       |  FGSM |       |      | PGD-10 |       |      | PGD-20 |       |      |    AA |       |      |
| method |       B |     L |     D |     B |     L |    D |      B |     L |    D |      B |     L |    D |     B |     L |    D |
|--------+---------+-------+-------+-------+-------+------+--------+-------+------+--------+-------+------+-------+-------+------|
| AT     |   62.94 | 62.77 |  0.17 | 46.18 | 41.24 | 4.94 |  44.41 | 38.44 | 5.97 |  42.28 | 35.98 |  6.3 | 38.52 | 34.20 | 4.32 |
| TRADES |   60.59 | 59.11 |  1.48 | 45.50 | 41.02 | 4.48 |  44.32 | 38.94 | 5.38 |  42.92 | 37.21 | 5.71 | 39.33 | 35.08 | 4.25 |
| AWP    |   64.46 | 65.10 | -0.64 | 49.16 | 48.67 | 0.49 |  47.45 | 47.20 | 0.25 |  45.63 | 45.21 | 0.42 | 41.40 | 41.01 | 0.39 |
#+TBLFM: $4=$2-$3::$7=$5-$6::$10=$8-$9::$13=$11-$12::$16=$14-$15
***** WideResNet-28-10
**** SVHN
***** ResNet-18
***** WideResNet-28-10
